{
    "categories": {
        "0": "social network",
        "1": "technical",
        "2": "data (things)"
    },
    "demo_page": "",
    "description": "Phyllo is a universal API gateway that provides Bubble users access to user-permissioned data across 20+ social platforms such as YouTube, TikTok, Instagram, Twitter, Facebook, Twitch, and more. \n\nPhyllo takes care of data normalization, platform partnerships, and app approvals, allowing you to focus your efforts on the product you’re building without spending additional bandwidth on infrastructure and maintenance.\n\nUse our Connect SDK to connect your creator's work platforms with the Phyllo API.\n\nPhyllo Connect SDK is the client-side component to integrate. Your creator will interact with this component to connect their work platform to Phyllo and allow you to access their identity, income, and work information via the Phyllo API. Phyllo Connect works on all modern browsers on all platforms.\n\nBubble Plugin Guide: https://docs.getphyllo.com/docs/api-reference/guides/phyllo-bubble\n\nComplete Documentation: https://docs.getphyllo.com/\n\nUse Case Library: https://www.getphyllo.com/recipes\n\nData Coverage Guide: https://bit.ly/40AEiq2",
    "image": "//s3.amazonaws.com/appforest_uf/f1670853304996x894174532968802000/logo.png",
    "license": "open_source",
    "link": "https://forum.bubble.io/t/bubble-phyllo-plugins-apis-to-access-creator-data/245909",
    "name": "Phyllo Connect SDK",
    "plugin_instructions": "1) There are two components to a Phyllo integration - the APIs and the Phyllo Connect SDK. \n\n2) The APIs run on the server side, and the Connect SDK presents itself on the user interface for the user to interact with and create a successful account connection. To separate these two components, we have built two Bubble plugins that simplify your understanding and streamline your Phyllo integration.\n\n3) To get the full benefit of Phyllo's product offerings, you MUST install and use both the below plugins in your integration and user journey.\n\nPhyllo APIs: https://bubble.io/plugin/phyllo-data-access-api-calls-1669024190924x470447009976549400\n\nPhyllo Connect SDK: https://bubble.io/plugin/phyllo-web-sdk---popup-1669016052921x881873042305187800\n\n4) After installing the ‘Phyllo Connect SDK’ and the ‘Phyllo APIs’ plugins, sign up on the Phyllo Developer dashboard - https://dashboard.getphyllo.com/registration to get access to the client ID and secret (in case you don’t have them already).\n\n5) You can then head over to our Bubble guide: https://docs.getphyllo.com/docs/api-reference/guides/phyllo-bubble to read the complete setup guide and start integrating Phyllo with Bubble!\n",
    "sa_node_version": 18
}